{
  "1": {
    "franchise_name": "Toronto Hogs",
    "abbrev": "TOR",
    "conference": "SCC",
    "owner_name": "Zac R",
    "primary": "#7a709b",
    "secondary": "#ea332a",
    "tertiary": "#4f4471",
    "font": "razorback",
    "description": "The Toronto Hogs have been a member of Sixth City since the inaugural season in 2021. The team name pays homage to Toronto's 19th-century meatpacking industry, capturing the gritty, blue-collar identity that defines this franchise. The Hogs embrace a ground-and-pound philosophy built around elite running back play, with Jonathan Taylor, Breece Hall, and Ashton Jeanty all taking snaps in Toronto during their careers. The front office operates with an analytical yet impulsive style that keeps things interesting on the trade block. Toronto's aggressive roster construction and commitment to elite playmakers have established them as a perennial threat, though not always a force, in the SCC.",
    "history": [
      {
        "season": [2021, 2022],
        "franchise_name": "Toronto Hogs",
        "abbrev": "TOH",
        "conference": "SCC",
        "owner_name": "Zac R",
        "primary": "#7a709b",
        "secondary": "#4f4471",
        "tertiary": "#b4b0b0",
        "font": "razorback",
        "description": "The Toronto Hogs have been a member of Sixth City since the inaugural season in 2021. The team name pays homage to Toronto's 19th-century meatpacking industry, capturing the gritty, blue-collar identity that defines this franchise. The Hogs embrace a ground-and-pound philosophy built around elite running back play, with Jonathan Taylor, Breece Hall, and Ashton Jeanty all taking snaps in Toronto during their careers. The front office operates with an analytical yet impulsive style that keeps things interesting on the trade block. Toronto's aggressive roster construction and commitment to elite playmakers have established them as a perennial threat, though not always a force, in the SCC."
      }
    ]
  },
  "2": {
    "franchise_name": "Bikini Bottom Stars",
    "abbrev": "BKB",
    "conference": "HCC",
    "owner_name": "Jacob G",
    "primary": "#b580ff",
    "secondary": "#ff808b",
    "tertiary": "#caff80",
    "font": "spongeboy",
    "description": "The Bikini Bottom Stars have been a member of Sixth City since the inaugural season in 2021. The franchise is inspired by the fictional underwater world of Spongebob Squarepants, with the \"Stars\" nickname honoring Patrick Star himself. Bikini Bottom has established itself as the league's most aggressive buyer, consistently trading draft capital for established talent and building perennial strength at wide receiver. The front office operates with a level-headed approach that capitalizes on opportunity, going all-in when championship windows open. This calculated aggression has made the Stars the most decorated franchise in Sixth City history, setting the standard for sustained excellence in the HCC."
  },
  "3": {
    "franchise_name": "Newfoundland Blowers",
    "abbrev": "NFD",
    "conference": "SCC",
    "owner_name": "Brendan D",
    "primary": "#ab3032",
    "secondary": "#192f5d",
    "tertiary": "#ae9273",
    "font": "spacelord",
    "description": "The Newfoundland Blowers have been a member of Sixth City since the inaugural season in 2021. The franchise draws its identity from the province's notoriously harsh Atlantic winds that batter the eastern coast, while the caribou logo honors Newfoundland and Labrador's iconic woodland caribou. The Blowers operate with a frenetic energy on the trade block, constantly wheeling and dealing in pursuit of the next big thing. While the front office demonstrates a keen eye for talent, their approach lacks long-term vision, occasionally resulting in moves that hinder rather than help. Newfoundland embraces an all-action philosophy, injecting themselves into every opportunity regardless of competitive timeline. This spirited, somewhat chaotic identity has made the Blowers one of the most entertaining franchises to follow in the SCC."
  },
  "4": {
    "franchise_name": "Thunder Bay Mustangs",
    "abbrev": "TBY",
    "conference": "SCC",
    "owner_name": "Steven S",
    "primary": "#0a2351",
    "secondary": "#81c78d",
    "tertiary": "#ffffff",
    "font": "horizon",
    "description": "The Thunder Bay Mustangs have been a member of Sixth City since the inaugural season in 2021, originally established as the Thunder Bay Sunshine before rebranding ahead of the 2022 campaign. The franchise maintains a luminous identity through its iconography, embodying a sense of brightness and clarity. Thunder Bay takes an analytical and calculated approach to roster construction, making quiet moves in the off-season that work toward a clear long-term vision. The Mustangs rarely make win-now pushes, instead preferring to preserve core talent and roster flexibility for sustained competitiveness. This patient, methodical philosophy has positioned Thunder Bay as a consistently dangerous opponent in the SCC, capable of striking when conditions align perfectly.",
    "history": [
      {
        "season": [2021],
        "franchise_name": "Thunder Bay Sunshine",
        "abbrev": "TBS",
        "conference": "SCC",
        "owner_name": "Steven S",
        "primary": "#f56600",
        "secondary": "#522d80",
        "tertiary": "#333333",
        "font": "clemson",
        "description": "The Thunder Bay Sunshine have been a member of Sixth City since the inaugural season in 2021, drawing inspiration from the dominant Clemson Tigers teams of 2018-2020. This connection culminates in the franchise's selection of Trevor Lawrence in the startup draft, which anchored the team's identity around the generational QB prospect. Thunder Bay, now operating as the Mustangs, takes an analytical and calculated approach to roster construction, making quiet moves in the off-season that work toward a clear long-term vision. They rarely make win-now pushes, instead preferring to preserve core talent and roster flexibility for sustained competitiveness. This patient, methodical philosophy has positioned Thunder Bay as a consistently dangerous opponent in the SCC, capable of striking when conditions align perfectly."
      }
    ]
  },
  "5": {
    "franchise_name": "Winnipeg Wranglers",
    "abbrev": "WPG",
    "conference": "HCC",
    "owner_name": "Ryan B",
    "primary": "#4262f9",
    "secondary": "#f3d971",
    "tertiary": "#1a018e",
    "font": "",
    "description": "The Winnipeg Wranglers have been a member of Sixth City since the inaugural season in 2021, originally established as the Winnipeg Wankers before rebranding ahead of the 2022 campaign. The franchise draws from the grit and resilience of prairie culture, where survival demands toughness and self-reliance in the face of harsh, unforgiving conditions. Winnipeg operates with a stars-and-scrubs philosophy, building around elite playmakers like Ja'Marr Chase, Justin Jefferson, and Jahmyr Gibbs while filling out the roster with depth pieces. The front office sends out plenty of trade offers but rarely finds a way to close deals. This, combined with a love-hate relationship with the game itself, has created a franchise defined by flashes of brilliance tempered by missed opportunities in the HCC.",
    "history": [
      {
        "season": [2021],
        "franchise_name": "Winnipeg Wankers",
        "abbrev": "WNK",
        "conference": "HCC",
        "owner_name": "Ryan B",
        "primary": "#041e42",
        "secondary": "#ba0c2f",
        "tertiary": "#d9c89d",
        "font": "",
        "description": "The Winnipeg Wankers have been a member of Sixth City since the inaugural season in 2021. The franchise rebranded to the Wranglers ahead of the 2022 season. Winnipeg operates with a stars-and-scrubs philosophy, building around elite playmakers like Ja'Marr Chase, Justin Jefferson, and Jahmyr Gibbs while filling out the roster with depth pieces. The front office sends out plenty of trade offers but rarely finds a way to close deals. This, combined with a love-hate relationship with the game itself, has created a franchise defined by flashes of brilliance tempered by missed opportunities in the HCC."
      }
    ]
  },
  "6": {
    "franchise_name": "Choccolocco Railfans",
    "abbrev": "CHC",
    "conference": "HCC",
    "owner_name": "Sean W",
    "primary": "#49351a",
    "secondary": "#d5913a",
    "tertiary": "#a58b8b",
    "font": "emblema",
    "description": "The Choccolocco Railfans have been a member of Sixth City since the inaugural season in 2021. Based in rural Alabama, the franchise draws from the region's railroad heritage and the blue-collar workers who built the rail lines threading through Appalachian foothills. Choccolocco maintains an extremely quiet presence on the trade block, rarely initiating discussions but always accessible when contacted. The front office understands the reality of their competitive position in any given year and acts accordingly with swift, informed decisiveness. This no-nonsense, precise approach has established the Railfans as one of the most respected franchises in the HCC."
  },
  "7": {
    "franchise_name": "Prince Edward Islanders",
    "abbrev": "PEI",
    "conference": "HCC",
    "owner_name": "Jared C",
    "primary": "#00d5d6",
    "secondary": "#ff6d01",
    "tertiary": "#002288",
    "font": "",
    "description": "The Prince Edward Islanders have been a member of Sixth City since the inaugural season in 2021, originally operating as Pokémon Omega Judge Judy before rebranding ahead of the 2025 campaign. The franchise now draws from the maritime heritage of Prince Edward Island, honoring the fishermen and traders who have worked the waters off Canada's smallest province for generations. The front office operates with an outspoken, confrontational style, led by a GM who isn't afraid to make enemies in pursuit of success. Prince Edward Island approaches the trade block with reckless abandon, embracing risk and volatility in roster construction. This aggressive, us-vs-the-world mentality has created one of the league's most polarizing franchises, but also one of the most dangerous competitors in the HCC.",
    "history": [
      {
        "season": [2021, 2022, 2023, 2024],
        "franchise_name": "Pokemon Omega Judge Judy",
        "abbrev": "PKO",
        "conference": "HCC",
        "owner_name": "Jared C",
        "primary": "#9b111e",
        "secondary": "#ffa502",
        "tertiary": "#000000",
        "font": "pokemon",
        "description": "Pokémon Omega Judge Judy was a member of Sixth City from the inaugural season in 2021 through the 2024 campaign. The franchise identity drew from an amalgamation of the Pokémon franchise, the reality court show presided over by Judge Judith Sheindlin, and Garfield, the lasagna-loving cartoon cat. The front office operates with an outspoken, confrontational style, led by a GM who isn't afraid to make enemies in pursuit of success. The team approaches the trade block with reckless abandon, embracing risk and volatility in roster construction. This aggressive, us-vs-the-world mentality has created one of the league's most polarizing franchises, but also one of the most dangerous competitors in the HCC."
      }
    ]
  },
  "8": {
    "franchise_name": "Iqaluit Trout",
    "abbrev": "IQT",
    "conference": "HCC",
    "owner_name": "Bret F",
    "primary": "#62b0e5",
    "secondary": "#c91b48",
    "tertiary": "#002b64",
    "font": "fishhook",
    "description": "The Iqaluit Trout have been a member of Sixth City since the inaugural season in 2021. Based in Nunavut, Canada's northernmost territory, the franchise draws from the frigid Arctic landscape and the wildlife that thrives in one of the world's harshest environments. The Trout have cultivated a self-deprecating identity but defends their honor against opposing teams when challenged. The Trout place strong emphasis on philanthropy and supporting their community, establishing themselves as one of the league's most socially conscious organizations. This blend of humility, defiance, and charitable commitment has created a franchise identity that extends far beyond wins and losses in the HCC."
  },
  "9": {
    "franchise_name": "New New York Benders",
    "abbrev": "NNY",
    "conference": "SCC",
    "owner_name": "Josh B",
    "primary": "#a6c1d6",
    "secondary": "#fffbc7",
    "tertiary": "#000d18",
    "font": "futurama",
    "description": "The New New York Benders have been a member of Sixth City since 2024, adopting the former Saskatoon Squirrels franchise under new ownership. The franchise draws from the animated world of Futurama, both from the setting itself and the hard-drinking robot protagonist Bender. The front office embodies a rebellious, irreverent spirit that Bender epitomizes, operates with flippant, full-throttle energy in drafts and on the trade block. New New York loves the game of football with genuine passion, even when results on the gridiron don't inspire confidence in future success. This spirited, all-action approach has made the Benders one of the league's most entertaining teams to watch, win or lose.",
    "history": [
      {
        "season": [2021, 2022, 2023],
        "franchise_name": "Saskatoon Squirrels",
        "abbrev": "SSK",
        "conference": "SCC",
        "owner_name": "Trey K",
        "primary": "#25b273",
        "secondary": "#000000",
        "tertiary": "#ffffff",
        "font": "virtu",
        "description": "The Saskatoon Squirrels were a member of Sixth City from the inaugural season in 2021 through the 2023 campaign. The franchise experienced three seasons of middling success, never breaking through in the playoffs nor collapsing enough to secure premium draft capital. Saskatoon operated with extreme quietness across all facets of league engagement—silent on the trade block, invisible in the war room, and rarely present in discussions with other managers. This passive approach ultimately led to the sale of the franchise following the 2023 season, with the team relocating and rebranding as the New New York Benders under new ownership."
      }
    ]
  },
  "10": {
    "franchise_name": "Lower City Lasercats",
    "abbrev": "LOW",
    "conference": "HCC",
    "owner_name": "Nathan L",
    "primary": "#df7937",
    "secondary": "#de432f",
    "tertiary": "#201719",
    "font": "mansalva",
    "description": "The Lower City Lasercats have been a member of Sixth City since 2024, adopting the former Calgary Cocks franchise under new ownership. The franchise operates with unconventional roster building strategies and head-turning trades that keep the rest of the league guessing. Lower City doesn't take anything overly seriously, approaching the game with a refreshing lightheartedness that makes them easy to work with and entertaining to watch. Always up for a good time on the gridiron and in conference with other ownership, the Lasercats have quickly established themselves as one of the league's most entertaining franchises. This fun-first philosophy, combined with creative roster construction, has made Lower City a breath of fresh air in the HCC.",
    "history": [
      {
        "season": [2021, 2022, 2023],
        "franchise_name": "Calgary Cocks",
        "abbrev": "CGY",
        "conference": "HCC",
        "owner_name": "Sam N",
        "primary": "#fb6605",
        "secondary": "#f2cd37",
        "tertiary": "#000000",
        "font": "",
        "description": "The Calgary Cocks were a member of Sixth City from the inaugural season in 2021 through the 2023 campaign. The franchise endured three disappointing seasons, hampered by a puzzling reluctance to start their best players despite having talent on the roster. Calgary operated with extreme quietness across all facets of league engagement—silent on the trade block, invisible in the war room, and rarely present in discussions with other managers. Despite the lackluster results, the Cocks found some success in the draft, stockpiling young assets that would eventually benefit their successors. The franchise was sold following the 2023 season and relocated to become the Lower City Lasercats under new ownership, transforming the foundation Calgary had built into a far more dynamic operation."
      }
    ]
  },
  "11": {
    "franchise_name": "Sarnia SeaSnakes",
    "abbrev": "SAR",
    "conference": "SCC",
    "owner_name": "Pat G",
    "primary": "#89bea4",
    "secondary": "#ec9bbc",
    "tertiary": "#5e905a",
    "font": "",
    "description": "The Sarnia SeaSnakes have been a member of Sixth City since 2023, adopting the former Montreal Generals franchise following the 2022 season and becoming the first relocated team in league history. Based in Ontario's chemical valley along the shores of Lake Huron, the franchise builds around a select few blue-chip players while surrounding them with young talent and banking on their ascension. Sarnia plays things close to the vest, keeping their intentions quiet until the right opportunity emerges, then striking decisively on the trade block. This patient yet opportunistic approach has positioned the SeaSnakes as a franchise perpetually on the cusp of contention in the SCC.",
    "history": [
      {
        "season": [2021, 2022],
        "franchise_name": "Montreal Generals",
        "abbrev": "MTL",
        "conference": "SCC",
        "owner_name": "Luke L",
        "primary": "#195ba0",
        "secondary": "#f22a3f",
        "tertiary": "#6f655c",
        "font": "army",
        "description": "The Montreal Generals were a member of Sixth City from the inaugural season in 2021 through the 2022 campaign. The franchise enjoyed a successful debut season before falling flat in year two, unable to recapture the momentum of their promising start. Montreal operated under boisterous ownership that got results at times but had the potential to rub others the wrong way with their aggressive approach. Following the disappointing 2022 season, the franchise was sold and relocated to Sarnia, becoming the SeaSnakes under new ownership. The Generals remain a brief but memorable chapter in Sixth City history as the league's first team to relocate."
      }
    ]
  },
  "12": {
    "franchise_name": "Mississauga Mastodons",
    "abbrev": "MIS",
    "conference": "HCC",
    "owner_name": "Braydon G",
    "primary": "#39bbf0",
    "secondary": "#9f5134",
    "tertiary": "#d7e7ed",
    "font": "ice_age",
    "description": "The Mississauga Mastodons have been a member of Sixth City since the inaugural season in 2021. The franchise operates with fierce loyalty to players they enjoy watching, building long-term relationships with their roster rather than constantly churning through talent. Mississauga stays reserved on the trade block but becomes outspoken and visible when the team catches fire. The Mastodons made history as the first franchise to develop a fight song, establishing a cultural identity that extends beyond the gridiron. This blend of player loyalty, selective aggression, and organizational pride has created a distinctive personality for the franchise."
  },
  "13": {
    "franchise_name": "Vancouver Mounties",
    "abbrev": "VAN",
    "conference": "SCC",
    "owner_name": "Connor G",
    "primary": "#012652",
    "secondary": "#a80012",
    "tertiary": "#c8cac7",
    "font": "wonderment",
    "description": "The Vancouver Mounties have been a member of Sixth City since the inaugural season in 2021. Drawing from the legacy of the Royal Canadian Mounted Police, the franchise operates with a combative, almost militant style. The front office becomes outspoken and visible when the team performs well, but falls completely silent during down periods. Vancouver is generally difficult to reach for trade discussions, preferring to operate on their own terms and timeline. This uncompromising approach makes them one of the most unpredictable presences in the SCC."
  },
  "14": {
    "franchise_name": "Gold Coast Sharks",
    "abbrev": "GLD",
    "conference": "SCC",
    "owner_name": "Logan S",
    "primary": "#ef979e",
    "secondary": "#006d75",
    "tertiary": "#e7cd78",
    "font": "cursive",
    "description": "The Gold Coast Sharks have been a member of Sixth City since the inaugural season in 2021. Based along Queensland's sun-soaked coast, the franchise operates with an extremely reserved and sometimes self-deprecating approach. The front office loves the game deeply and operates as an accessible presence rather than as some untouchable entity. This hands-on, humble style has made Gold Coast one of the league's most approachable franchises.",
    "history": [
      {
        "season": [2021],
        "franchise_name": "Unsolicited Dak Pics",
        "abbrev": "DAK",
        "conference": "SCC",
        "owner_name": "Logan S",
        "primary": "#3a4283",
        "secondary": "#814a35",
        "tertiary": "#e5e2e0",
        "font": "",
        "description": "The Unsolicited Dak Pics have been a member of Sixth City since the inaugural season in 2021. The franchise rebranded to the Gold Coast Sharks ahead of the 2022 campaign. They operate with an extremely reserved and sometimes self-deprecating approach. The front office loves the game deeply and operates as an accessible presence rather than as some untouchable entity. This hands-on, humble style has made them one of the league's most approachable franchises."
      }
    ]
  }
}
